<a href="https://colab.research.google.com/github/CarohN/SQL-Project-/blob/main/Week_2_Project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///stud_db.db

In [3]:
%%sql CREATE TABLE personal_details (
    national_ID INTEGER(15) ,
    stud_ID VARCHAR(15),
    stud_name VARCHAR(100),
    phone_number VARCHAR(15),
    age INTEGER,
    gender VARCHAR(10),
    PRIMARY KEY(national_ID) );

 * sqlite:///stud_db.db
Done.

[]

In [4]:
%%sql INSERT INTO personal_details (national_ID,stud_ID,stud_name,phone_number,age,gender)
VALUES("344534","stud101","Hermione Granger" ,"0712345678",20,"Male"),
("379683","stud102","Draco Malfo" ,"0723456781",21,"Female"),
("347403","stud103","Jayden Wamashati" ,"0734567812",22,"Male"),
("377302","stud104","Ron Weasley" ,"0745678123",19,"Female"),
("336741","stud105","Dolores Umbridge" ,"0756781234",21,"Male"),
("307243","stud106","Hedwig Tonks" ,"0767812345",21,"Female"),
("310932","stud107","Chao Chang" ,"0778123456",22,"Male"),
("343920","stud108","Curfew Yaeitpm" ,"0781234567",20,"Female"),
("345261","stud109","Chaptr Mukenya" ,"0722345678",20,"Male"),
("339152","stud110","Natalie Mpema" ,"0733456781",21,"Female"),
("339746","stud111","Crew Nundi" ,"0744567812",20,"Male"),
("336373","stud112","Bandi Kagunda" ,"0755678123",22,"Female"),
("325252","stud113","Testimony Omolo" ,"0766456781",21,"Male"),
("321746","stud114","Career Mpya" ,"0741367812",20,"Male"),
("390234","stud115","Deamon Anduro" ,"0744421123",22,"Female");

 * sqlite:///stud_db.db
15 rows affected.

[]

In [5]:
%%sql SELECT *
FROM personal_details

 * sqlite:///stud_db.db
Done.

[(344534, 'stud101', 'Hermione Granger', '0712345678', 20, 'Male'),
 (379683, 'stud102', 'Draco Malfo', '0723456781', 21, 'Female'),
 (347403, 'stud103', 'Jayden Wamashati', '0734567812', 22, 'Male'),
 (377302, 'stud104', 'Ron Weasley', '0745678123', 19, 'Female'),
 (336741, 'stud105', 'Dolores Umbridge', '0756781234', 21, 'Male'),
 (307243, 'stud106', 'Hedwig Tonks', '0767812345', 21, 'Female'),
 (310932, 'stud107', 'Chao Chang', '0778123456', 22, 'Male'),
 (343920, 'stud108', 'Curfew Yaeitpm', '0781234567', 20, 'Female'),
 (345261, 'stud109', 'Chaptr Mukenya', '0722345678', 20, 'Male'),
 (339152, 'stud110', 'Natalie Mpema', '0733456781', 21, 'Female'),
 (339746, 'stud111', 'Crew Nundi', '0744567812', 20, 'Male'),
 (336373, 'stud112', 'Bandi Kagunda', '0755678123', 22, 'Female'),
 (325252, 'stud113', 'Testimony Omolo', '0766456781', 21, 'Male'),
 (321746, 'stud114', 'Career Mpya', '0741367812', 20, 'Male'),
 (390234, 'stud115', 'Deamon Anduro', '0744421123', 22, 'Female')]

In [6]:
%%sql CREATE TABLE school_details(
    stud_ID VARCHAR(15),
    current_home_county VARCHAR(20),
    secondary_school_county VARCHAR(20),
    residence VARCHAR(15),
    stud_email VARCHAR(50),
    PRIMARY KEY (stud_ID)
    );

 * sqlite:///stud_db.db
Done.

[]

In [7]:
%%sql INSERT INTO school_details(stud_ID)
SELECT stud_ID
FROM personal_details;

 * sqlite:///stud_db.db
15 rows affected.

[]

In [8]:
%%sql UPDATE school_details
SET stud_email = (SELECT REPLACE(stud_name, ' ', '') || '@zinduaschool.ac'
                  FROM personal_details
                  WHERE school_details.stud_ID = personal_details.stud_ID);

 * sqlite:///stud_db.db
15 rows affected.

[]

In [ ]:
%%sql UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud101";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud102";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud103";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="In school" WHERE stud_ID="stud104";
UPDATE school_details SET current_home_county="Nyamira", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud105";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud106";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud107";
UPDATE school_details SET current_home_county="Kisumu", secondary_school_county="Mombasa", residence="Out of school" WHERE stud_ID="stud108";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud109";
UPDATE school_details SET current_home_county="Nakuru", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud110";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Turkana", residence="In school" WHERE stud_ID="stud111";
UPDATE school_details SET current_home_county="Nairobi", secondary_school_county="Nakuru", residence="In school" WHERE stud_ID="stud112";
UPDATE school_details SET current_home_county="Samburu", secondary_school_county="Taita Taveta", residence="In school" WHERE stud_ID="stud113";
UPDATE school_details SET current_home_county="Kericho", secondary_school_county="Nairobi", residence="Out of school" WHERE stud_ID="stud114";
UPDATE school_details SET current_home_county="Kiambu", secondary_school_county="Mombasa", residence="In school" WHERE stud_ID="stud115";

In [10]:
%%sql SELECT *
FROM school_details

 * sqlite:///stud_db.db
Done.

[('stud101', 'Nakuru', 'Nairobi', 'In school', 'HermioneGranger@zinduaschool.ac'),
 ('stud102', 'Nairobi', 'Nakuru', 'In school', 'DracoMalfo@zinduaschool.ac'),
 ('stud103', 'Samburu', 'Nairobi', 'Out of school', 'JaydenWamashati@zinduaschool.ac'),
 ('stud104', 'Kericho', 'Nairobi', 'In school', 'RonWeasley@zinduaschool.ac'),
 ('stud105', 'Nyamira', 'Nakuru', 'In school', 'DoloresUmbridge@zinduaschool.ac'),
 ('stud106', 'Kisumu', 'Nairobi', 'Out of school', 'HedwigTonks@zinduaschool.ac'),
 ('stud107', 'Nakuru', 'Nairobi', 'Out of school', 'ChaoChang@zinduaschool.ac'),
 ('stud108', 'Kisumu', 'Mombasa', 'Out of school', 'CurfewYaeitpm@zinduaschool.ac'),
 ('stud109', 'Kericho', 'Mombasa', 'In school', 'ChaptrMukenya@zinduaschool.ac'),
 ('stud110', 'Nakuru', 'Mombasa', 'In school', 'NatalieMpema@zinduaschool.ac'),
 ('stud111', 'Kiambu', 'Turkana', 'In school', 'CrewNundi@zinduaschool.ac'),
 ('stud112', 'Nairobi', 'Nakuru', 'In school', 'BandiKagunda@zinduaschool.ac'),
 ('stud113', 'Samburu', 'Taita Taveta', 'In school', 'TestimonyOmolo@zinduaschool.ac'),
 ('stud114', 'Kericho', 'Nairobi', 'Out of school', 'CareerMpya@zinduaschool.ac'),
 ('stud115', 'Kiambu', 'Mombasa', 'In school', 'DeamonAnduro@zinduaschool.ac')]

In [11]:
%%sql CREATE TABLE contact_details (stud_email VARCHAR(50) PRIMARY KEY, phone_number VARCHAR(15), next_of_kin_name VARCHAR(50),next_of_kin_relation VARCHAR(10), next_of_kin_contacts VARCHAR(13) );
INSERT INTO contact_details(phone_number, next_of_kin_name,next_of_kin_relation,next_of_kin_contacts)
VALUES("0712345678","Darius Young","Father","0782382383"),
("0723456781","Lucy Nderitu","Mother","0723238983"),
("0734567812","Jerotich Koech","Mother","0779343126"),
("0745678123","Mwaura Mwangi","Father","0798246347"),
("0756781234","Ian Patrick","Father","0711234453"),
("0767812345","Lebron James","Father","0765439233"),
("0778123456","Magna Carter","Father","0702526243"),
("0781234567","Cindy Wayne","Mother","0747282839"),
("0722345678","Farah Maalim","Mother","0753927482"),
("0733456781","Faiba Mbugua","Father","0713245748"),
("0744567812","John Doe","Father","0725737383"),
("0755678123","Klaus Michealson","Father","0789346276"),
("0766456781","Suluhu Amdany","Mother","0785739259"),
("0741367812","Daisy Auma","Mother","0791344537"),
("0755421123","Getrude Karen","Mother","0765748244");

 * sqlite:///stud_db.db
Done.
15 rows affected.

[]

In [12]:
%%sql UPDATE contact_details
SET stud_email = (SELECT school_details.stud_email
FROM school_details, personal_details
WHERE school_details.stud_ID = personal_details.stud_ID
AND personal_details.phone_number = contact_details.phone_number);

 * sqlite:///stud_db.db
15 rows affected.

[]

In [13]:
%%sql SELECT *
FROM contact_details

 * sqlite:///stud_db.db
Done.

[('HermioneGranger@zinduaschool.ac', '0712345678', 'Darius Young', 'Father', '0782382383'),
 ('DracoMalfo@zinduaschool.ac', '0723456781', 'Lucy Nderitu', 'Mother', '0723238983'),
 ('JaydenWamashati@zinduaschool.ac', '0734567812', 'Jerotich Koech', 'Mother', '0779343126'),
 ('RonWeasley@zinduaschool.ac', '0745678123', 'Mwaura Mwangi', 'Father', '0798246347'),
 ('DoloresUmbridge@zinduaschool.ac', '0756781234', 'Ian Patrick', 'Father', '0711234453'),
 ('HedwigTonks@zinduaschool.ac', '0767812345', 'Lebron James', 'Father', '0765439233'),
 ('ChaoChang@zinduaschool.ac', '0778123456', 'Magna Carter', 'Father', '0702526243'),
 ('CurfewYaeitpm@zinduaschool.ac', '0781234567', 'Cindy Wayne', 'Mother', '0747282839'),
 ('ChaptrMukenya@zinduaschool.ac', '0722345678', 'Farah Maalim', 'Mother', '0753927482'),
 ('NatalieMpema@zinduaschool.ac', '0733456781', 'Faiba Mbugua', 'Father', '0713245748'),
 ('CrewNundi@zinduaschool.ac', '0744567812', 'John Doe', 'Father', '0725737383'),
 ('BandiKagunda@zinduaschool.ac', '0755678123', 'Klaus Michealson', 'Father', '0789346276'),
 ('TestimonyOmolo@zinduaschool.ac', '0766456781', 'Suluhu Amdany', 'Mother', '0785739259'),
 ('CareerMpya@zinduaschool.ac', '0741367812', 'Daisy Auma', 'Mother', '0791344537'),
 (None, '0755421123', 'Getrude Karen', 'Mother', '0765748244')]

In [14]:
%%sql CREATE TABLE financial_details (
    stud_ID VARCHAR(15) ,
    stud_name VARCHAR(50) ,
sem_fee INTEGER(6) ,
fee_paid INTEGER(6),
PRIMARY KEY(stud_ID) );

 * sqlite:///stud_db.db
Done.

[]

In [15]:
%%sql INSERT INTO financial_details(stud_ID,stud_name)
SELECT personal_details.stud_ID, personal_details.stud_name
FROM personal_details;

 * sqlite:///stud_db.db
15 rows affected.

[]

In [ ]:
%%sql UPDATE financial_details SET sem_fee = 25000, fee_paid=25000 WHERE stud_ID = "stud101";
UPDATE financial_details SET sem_fee= 25000, fee_paid=19000 WHERE stud_ID = "stud102";
UPDATE financial_details SET sem_fee= 21900, fee_paid=20000 WHERE stud_ID = "stud103";
UPDATE financial_details SET sem_fee= 22000, fee_paid=22000 WHERE stud_ID = "stud104";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23400 WHERE stud_ID = "stud105";
UPDATE financial_details SET sem_fee= 25000, fee_paid=27000 WHERE stud_ID = "stud106";
UPDATE financial_details SET sem_fee= 24230, fee_paid=21200 WHERE stud_ID = "stud107";
UPDATE financial_details SET sem_fee= 25000, fee_paid=23500 WHERE stud_ID = "stud108";
UPDATE financial_details SET sem_fee= 25000, fee_paid=24500 WHERE stud_ID = "stud109";
UPDATE financial_details SET sem_fee= 25000, fee_paid=25000 WHERE stud_ID = "stud110";
UPDATE financial_details SET sem_fee= 26000, fee_paid=26000 WHERE stud_ID = "stud111";
UPDATE financial_details SET sem_fee= 25000, fee_paid=20900 WHERE stud_ID = "stud112";
UPDATE financial_details SET sem_fee= 25000, fee_paid=22300 WHERE stud_ID = "stud113";
UPDATE financial_details SET sem_fee= 19000, fee_paid=19000 WHERE stud_ID = "stud114";
UPDATE financial_details SET sem_fee= 20800, fee_paid=20800 WHERE stud_ID = "stud115";

In [17]:
%%sql SELECT *
FROM financial_details

 * sqlite:///stud_db.db
Done.

[('stud101', 'Hermione Granger', 25000, 25000),
 ('stud102', 'Draco Malfo', 25000, 19000),
 ('stud103', 'Jayden Wamashati', 21900, 20000),
 ('stud104', 'Ron Weasley', 22000, 22000),
 ('stud105', 'Dolores Umbridge', 25000, 23400),
 ('stud106', 'Hedwig Tonks', 25000, 27000),
 ('stud107', 'Chao Chang', 24230, 21200),
 ('stud108', 'Curfew Yaeitpm', 25000, 23500),
 ('stud109', 'Chaptr Mukenya', 25000, 24500),
 ('stud110', 'Natalie Mpema', 25000, 25000),
 ('stud111', 'Crew Nundi', 26000, 26000),
 ('stud112', 'Bandi Kagunda', 25000, 20900),
 ('stud113', 'Testimony Omolo', 25000, 22300),
 ('stud114', 'Career Mpya', 19000, 19000),
 ('stud115', 'Deamon Anduro', 20800, 20800)]

**a. Using JOIN get the student names, school id, email, phone number (new_stud_details)**

In [22]:
%%sql CREATE VIEW new_stud_details AS
SELECT pd.stud_name, sd.stud_email, pd.phone_number
FROM personal_details pd
JOIN school_details sd ON pd.student_id = sd.student_id;

 * sqlite:///stud_db.db
Done.

[]

In [23]:
%%sql SELECT *
FROM new_stud_details

 * sqlite:///stud_db.db
(sqlite3.OperationalError) no such column: pd.student_id
[SQL: SELECT *
FROM new_stud_details]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

**b. Create a table with all the details from contacts to school and financial details (full_stud_details)**

In [27]:
%%sql CREATE TABLE full_stud_details AS
SELECT
  c.stud_email,
  c.phone_number,
  c.next_of_kin_name,
  c.next_of_kin_relation,
  c.next_of_kin_contacts,
  s.current_home_county,
  s.secondary_school_county,
  s.residence,
  f.stud_ID,
  f.stud_name,
  f.sem_fee,
  f.fee_paid
FROM
  contact_details c
  JOIN school_details s ON c.stud_email = s.stud_email
  JOIN financial_details f ON s.stud_ID = f.stud_ID;

 * sqlite:///stud_db.db
Done.

[]

In [28]:
%sql SELECT * FROM full_stud_details;

 * sqlite:///stud_db.db
Done.

[('HermioneGranger@zinduaschool.ac', '0712345678', 'Darius Young', 'Father', '0782382383', 'Nakuru', 'Nairobi', 'In school', 'stud101', 'Hermione Granger', 25000, 25000),
 ('DracoMalfo@zinduaschool.ac', '0723456781', 'Lucy Nderitu', 'Mother', '0723238983', 'Nairobi', 'Nakuru', 'In school', 'stud102', 'Draco Malfo', 25000, 19000),
 ('JaydenWamashati@zinduaschool.ac', '0734567812', 'Jerotich Koech', 'Mother', '0779343126', 'Samburu', 'Nairobi', 'Out of school', 'stud103', 'Jayden Wamashati', 21900, 20000),
 ('RonWeasley@zinduaschool.ac', '0745678123', 'Mwaura Mwangi', 'Father', '0798246347', 'Kericho', 'Nairobi', 'In school', 'stud104', 'Ron Weasley', 22000, 22000),
 ('DoloresUmbridge@zinduaschool.ac', '0756781234', 'Ian Patrick', 'Father', '0711234453', 'Nyamira', 'Nakuru', 'In school', 'stud105', 'Dolores Umbridge', 25000, 23400),
 ('HedwigTonks@zinduaschool.ac', '0767812345', 'Lebron James', 'Father', '0765439233', 'Kisumu', 'Nairobi', 'Out of school', 'stud106', 'Hedwig Tonks', 25000, 27000),
 ('ChaoChang@zinduaschool.ac', '0778123456', 'Magna Carter', 'Father', '0702526243', 'Nakuru', 'Nairobi', 'Out of school', 'stud107', 'Chao Chang', 24230, 21200),
 ('CurfewYaeitpm@zinduaschool.ac', '0781234567', 'Cindy Wayne', 'Mother', '0747282839', 'Kisumu', 'Mombasa', 'Out of school', 'stud108', 'Curfew Yaeitpm', 25000, 23500),
 ('ChaptrMukenya@zinduaschool.ac', '0722345678', 'Farah Maalim', 'Mother', '0753927482', 'Kericho', 'Mombasa', 'In school', 'stud109', 'Chaptr Mukenya', 25000, 24500),
 ('NatalieMpema@zinduaschool.ac', '0733456781', 'Faiba Mbugua', 'Father', '0713245748', 'Nakuru', 'Mombasa', 'In school', 'stud110', 'Natalie Mpema', 25000, 25000),
 ('CrewNundi@zinduaschool.ac', '0744567812', 'John Doe', 'Father', '0725737383', 'Kiambu', 'Turkana', 'In school', 'stud111', 'Crew Nundi', 26000, 26000),
 ('BandiKagunda@zinduaschool.ac', '0755678123', 'Klaus Michealson', 'Father', '0789346276', 'Nairobi', 'Nakuru', 'In school', 'stud112', 'Bandi Kagunda', 25000, 20900),
 ('TestimonyOmolo@zinduaschool.ac', '0766456781', 'Suluhu Amdany', 'Mother', '0785739259', 'Samburu', 'Taita Taveta', 'In school', 'stud113', 'Testimony Omolo', 25000, 22300),
 ('CareerMpya@zinduaschool.ac', '0741367812', 'Daisy Auma', 'Mother', '0791344537', 'Kericho', 'Nairobi', 'Out of school', 'stud114', 'Career Mpya', 19000, 19000)]

**c. Add student names on any empty row of stud_name in financial_details**

In [31]:
%%sql UPDATE financial_details
SET stud_name = (
    SELECT stud_name
    FROM personal_details
    WHERE personal_details.stud_ID = financial_details.stud_ID
)
WHERE stud_name IS NULL;

 * sqlite:///stud_db.db
0 rows affected.

[]

In [35]:
%%sql SELECT *
FROM financial_details;

 * sqlite:///stud_db.db
Done.

[('stud101', 'Hermione Granger', 25000, 25000),
 ('stud102', 'Draco Malfo', 25000, 19000),
 ('stud103', 'Jayden Wamashati', 21900, 20000),
 ('stud104', 'Ron Weasley', 22000, 22000),
 ('stud105', 'Dolores Umbridge', 25000, 23400),
 ('stud106', 'Hedwig Tonks', 25000, 27000),
 ('stud107', 'Chao Chang', 24230, 21200),
 ('stud108', 'Curfew Yaeitpm', 25000, 23500),
 ('stud109', 'Chaptr Mukenya', 25000, 24500),
 ('stud110', 'Natalie Mpema', 25000, 25000),
 ('stud111', 'Crew Nundi', 26000, 26000),
 ('stud112', 'Bandi Kagunda', 25000, 20900),
 ('stud113', 'Testimony Omolo', 25000, 22300),
 ('stud114', 'Career Mpya', 19000, 19000),
 ('stud115', 'Deamon Anduro', 20800, 20800)]

**d. On the financial_details table add a column, fee_cleared, that has True if student has cleared current fee and False if not (financial_details_view)**

In [36]:
%%sql ALTER TABLE financial_details
ADD COLUMN fee_cleared BOOLEAN;

 * sqlite:///stud_db.db
Done.

[]

In [49]:
%%sql UPDATE financial_details
SET fee_cleared = CASE
                     WHEN fee_paid >= sem_fee THEN 'True'
                     ELSE 'False'
                 END;

 * sqlite:///stud_db.db
15 rows affected.

[]

In [50]:
%%sql SELECT *
FROM financial_details;

 * sqlite:///stud_db.db
Done.

[('stud101', 'Hermione Granger', 25000, 25000, 'True'),
 ('stud102', 'Draco Malfo', 25000, 19000, 'False'),
 ('stud103', 'Jayden Wamashati', 21900, 20000, 'False'),
 ('stud104', 'Ron Weasley', 22000, 22000, 'True'),
 ('stud105', 'Dolores Umbridge', 25000, 23400, 'False'),
 ('stud106', 'Hedwig Tonks', 25000, 27000, 'True'),
 ('stud107', 'Chao Chang', 24230, 21200, 'False'),
 ('stud108', 'Curfew Yaeitpm', 25000, 23500, 'False'),
 ('stud109', 'Chaptr Mukenya', 25000, 24500, 'False'),
 ('stud110', 'Natalie Mpema', 25000, 25000, 'True'),
 ('stud111', 'Crew Nundi', 26000, 26000, 'True'),
 ('stud112', 'Bandi Kagunda', 25000, 20900, 'False'),
 ('stud113', 'Testimony Omolo', 25000, 22300, 'False'),
 ('stud114', 'Career Mpya', 19000, 19000, 'True'),
 ('stud115', 'Deamon Anduro', 20800, 20800, 'True')]

**e. Get the national ID and name of all students who have cleared their fees (fee_cleared)**

In [52]:
%%sql SELECT pd.national_ID, pd.stud_name
FROM personal_details pd
JOIN financial_details fd ON pd.stud_id = fd.stud_id
WHERE fd.fee_cleared = 'True';

 * sqlite:///stud_db.db
Done.

[(344534, 'Hermione Granger'),
 (377302, 'Ron Weasley'),
 (307243, 'Hedwig Tonks'),
 (339152, 'Natalie Mpema'),
 (339746, 'Crew Nundi'),
 (321746, 'Career Mpya'),
 (390234, 'Deamon Anduro')]

**f. Get the total sum of fees paid so far and the total current deficit (total_fee_balance)**

In [54]:
%%sql SELECT
    SUM(fee_paid) AS total_fees_paid,
    SUM(CASE WHEN fee_paid < sem_fee THEN sem_fee - fee_paid ELSE 0 END) AS total_fee_deficit
FROM
    financial_details;

 * sqlite:///stud_db.db
Done.

[(339600, 21330)]

**g. Get the count of students who share a current home county i.e., Say Nairobi, get the number of students who’s current_home_county is Nairobi, and so on for all available counties (home_county_count)**

In [55]:
%%sql SELECT
    current_home_county,
    COUNT(*) AS home_county_count
FROM
    school_details
GROUP BY
    current_home_county;

 * sqlite:///stud_db.db
Done.

[('Kericho', 3),
 ('Kiambu', 2),
 ('Kisumu', 2),
 ('Nairobi', 2),
 ('Nakuru', 3),
 ('Nyamira', 1),
 ('Samburu', 2)]

**h. Get the count of Male and/or Female students from each secondary_school_county (secondary_school_count). The table should contain a column for male student count and female student count for each county.**

In [58]:
%%sql SELECT
    sd.secondary_school_county,
    SUM(CASE WHEN pd.gender = 'Male' THEN 1 ELSE 0 END) AS male_count,
    SUM(CASE WHEN pd.gender = 'Female' THEN 1 ELSE 0 END) AS female_count
FROM
    school_details sd
JOIN
    personal_details pd ON sd.stud_id = pd.stud_id
GROUP BY
    sd.secondary_school_county;

 * sqlite:///stud_db.db
Done.

[('Mombasa', 1, 3),
 ('Nairobi', 4, 2),
 ('Nakuru', 1, 2),
 ('Taita Taveta', 1, 0),
 ('Turkana', 1, 0)]

**i. Get the percentage of students who set their next_of_kin as Mother vs those that set it as Father1. (kin_percentage) :**

In [61]:
%%sql SELECT
    SUM(CASE WHEN next_of_kin_relation = 'Mother' THEN 1 ELSE 0 END) AS mother_count,
    SUM(CASE WHEN next_of_kin_relation = 'Father1' THEN 1 ELSE 0 END) AS father_count,
    (SUM(CASE WHEN next_of_kin_relation = 'Mother' THEN 1 ELSE 0 END) * 1.0 / COUNT(*)) * 100 AS mother_percentage,
    (SUM(CASE WHEN next_of_kin_relation = 'Father1' THEN 1 ELSE 0 END) * 1.0 / COUNT(*)) * 100 AS father_percentage
FROM
    contact_details;

 * sqlite:///stud_db.db
Done.

[(7, 0, 46.666666666666664, 0.0)]